Repository: Hazelnut22/plant_vision
Catalog: lib/l10n/app_*.arb
Languages: my

source: Hello World!
my: မင်္ဂလာပါ!

# abouttitle
source: About This App
my: ဒီ app အကြောင်း

# welcomeDisplay
source: Welcome to Plant Vision!
my: Plant Vision မှကြိုဆိုပါတယ်!

# detectFeature
source: Snap a photo of a plant leaf, and our AI will instantly identify up to 30 common diseases.
my: အပင်၏အရွက်ကိုဓာတ်ပုံရိုက်၍ အပင်ရောဂါကို AI နှင့်စမ်းသပ်ရန်

# recommendFeature
source: Our chatbot, available in Burmese, answers your plant-related questions and provides care tips.
my: မြန်မာဘာသာစကားသုံး၍ အပင်နှင့်ပတ်သတ်သောအကြောင်းအရာများကိုမေးရန်

# chatFeature
source: Receive tailored crop suggestions to maximize yield and suit local conditions.
my: သီးနှံအထွက်နှုန်းမြင့်မားလာ၍ ကိုယ့်ဒေသအခြေအနေအလိုက် စိုက်ပျိုးမြေနှင့် သင့်တော်သော သီးနှံများ သိရှိရန်

# motto
source: All you need for your plants is plant vision.
my: Plant Vision - အပင်များအတွက်အလိုအပ်ဆုံးသည်သာ

# cropRecommend
source: Crop Recommendation
my: ဘယ်သီးနှံစိုက်ရမလဲ

# detectDiseases
source: Detect Your Plant Disease
my: အပင်၏အရွက်ရောဂါရှာဖွေပါ

# detectDescription
source: Search plant diseases with AI
my: အပင်အရွက်ရောဂါကို AI ဖြင့်ရှာဖွေပါ

# noImage
source: No image selected.
my: သင်ပုံရွေးချယ်ထားခြင်းမရှိပါ

source: Prediction
my: ခန့်မှန်းချက်

source: Confidence
my: ဖြစ်နိုင်ချေ

# treatment
source: Treatment Steps
my: ကုသရန်အဆင့်များ

source: Recommendation
my: အကြံပေးချက်

# uploadGallery
source: Upload from Gallery
my: ပုံတင်ရန်

source: Take Photo
my: ဓာတ်ပုံရိုက်ရန်

# temperature
source: Temperature in Celsius
my: အပူချိန် celsius ဒီဂရီ

source: Humidity
my: စိုထိုင်းဆ

source: Rainfall
my: မိုးရေချိန်

source: Recommend
my: စိုက်ပျိုးသီးနှံအတွက်အကြံပြုချက်ယူပါ

# ok
source: Okay
my: အိုကေ

# recommendDescription
source: Input these information
my: ဤအချက်အလက်များကိုထည့်သွင်းပါ

source: Nitrogen
my: နိုက်ထရိုဂျင်

source: Phosphorus
my: ဖော့စဖိုရပ်

source: Potassium
my: ပိုတက်စီယမ်

source: Enter {value}
my: {value}ကိုရိုက်ထည့်ပါ

# errorValue
source: Enter a value
my: တန်ဖိုးတစ်ခုထည့်ပါ

# errorRange
source: Put a value in range between {start} and {end}
my: ပမာဏအား {start} မှ {end} ကြားထားပါ

# chatbot
source: Plant Chatbot
my: မြန်မာ အပင်Chatbot

# askMe
source: Ask me about plants
my: အပင်နှင့်ပတ်သတ်သမျှမေးနိုင်ပါသည်။

# question
source: a question
my: မေးခွန်း
